ys1797/esp32_hd/main/hd_main.c
		}

		//---проверим: не пора ли завершить тело и перейти к хвостам?
		if (end_condition_SR())	{
			// Переходим к отбору хвостов
			closeKlp(klp_sr);	// Отключение клапана отбора товарного продукта
			// Устанавливаем ШИМ клапан отбора хвостов и голов
			start_valve_PWMpercent(klp_glwhq,
					getFloatParam(DEFL_PARAMS, "timeChimRectOtbGlv"),
					100); // хвост отбираем на все 100 !
       			setNewMainStatus(PROC_HV);
			if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
			break;
		}
		
		if (getTube20Temp() > tempStabSR) {
			break;
		}

		// Переход к отбору товарного продукта

		// Реализуется отбор по-шпоре, что в функции прописано то и будет возвращено.
		setNewProcChimSR(GetSrPWM());
		closeKlp(klp_glwhq); // Отключение клапана отбора голов/хвостов 
		// Устанавливаем медленный ШИМ клапана продукта
		start_valve_PWMpercent
		  ( klp_sr, // клапан продукта
			getFloatParam(DEFL_PARAMS, "timeChimRectOtbSR"),// период ШИМ в сек
			ProcChimSR //%
		  );

		secTempPrev = uptime_counter;	// Запомним время, когда стабилизировалась температура
		setNewMainStatus(PROC_SR);	// Переход к отбору продукта
		if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
#ifdef DEBUG
		ESP_LOGI(TAG, "Switch state to SR. Temperature: %0.2f", tempStabSR);
#endif
                 /* fall through */

	case PROC_SR:
		// Отбор СР
		t = getTube20Temp();

		int minProcChimOtbSR = getIntParam(DEFL_PARAMS, "minProcChimOtbSR");

		if (t < tempStabSR) {	//если температура стала ниже Т стабилизации, то принимаем ее за новую Т стабилизации (ПБ)
			setTempStabSR(t);
		}

		if (t >= tempStabSR + getFloatParam(DEFL_PARAMS, "tempDeltaRect")) {
			// Температура превысила температуру стабилизации
			closeKlp(klp_sr); // Отключение клапана продукта
			int cntCHIM = getIntParam(DEFL_PARAMS, "cntCHIM");

			if (cntCHIM < 0) {
				// Запоминаем температуру, когда произошел стоп за вычетом 0.1 градуса.
				autoPWM[-cntCHIM].temp = t - 0.1;
				autoPWM[-cntCHIM].pwm = ProcChimSR;
				if (-cntCHIM < COUNT_PWM-1) cntCHIM--;
			}
			int decrementCHIM = getIntParam(DEFL_PARAMS, "decrementCHIM");
			if (decrementCHIM>=0) { 
				// Тогда уменьшаем  ШИМ указанное число процентов в абсолютном выражении
				setNewProcChimSR(ProcChimSR-decrementCHIM);
			} else {
				uint16_t v = (ProcChimSR * (-decrementCHIM))/100;
				// Процентное отношение может быть очень мало,
				// поэтому если получилось нулевое значение, то вычтем единицу.
				if (v<=0) v=1;
				setNewProcChimSR(ProcChimSR - v); // Тогда увеличиваем ШИМ на число процентов в относительном выражении
			}
			if (ProcChimSR < minProcChimOtbSR) setNewProcChimSR(minProcChimOtbSR);
			rect_timer1 = getIntParam(DEFL_PARAMS, "timeRestabKolonna"); // Установка таймера стабилизации
			setNewMainStatus(PROC_T_WAIT); // Переходим в режим стабилизации
			if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
#ifdef DEBUG
			ESP_LOGI(TAG, "Switch state to temperature re-stabilization.");
#endif
			break;
		} else {
			int timeAutoIncCHIM = getIntParam(DEFL_PARAMS, "timeAutoIncCHIM");
        		if (timeAutoIncCHIM>0 && (uptime_counter - secTempPrev) > timeAutoIncCHIM) {
				// Если температура не выросла более, чем за 10 минут, прибавим ШИМ на 5%
				if (ProcChimSR > minProcChimOtbSR) {
					// Шим прибавляем только если не дошли до минимального
					int incrementCHIM = getIntParam(DEFL_PARAMS, "incrementCHIM");
					if (incrementCHIM>=0) {
						// Абсолютное значение
						setNewProcChimSR(ProcChimSR + incrementCHIM);
					} else {
						// Проценты
						setNewProcChimSR(ProcChimSR + (ProcChimSR*(-incrementCHIM))/100);
					}
					if (ProcChimSR>95) setNewProcChimSR(95);
					// Устанавливаем 90% медленный ШИМ клапан отбора хвостов и голов
					start_valve_PWMpercent
					  ( klp_sr, // клапан продукта
						getFloatParam(DEFL_PARAMS, "timeChimRectOtbSR"),// период ШИМ в сек
						ProcChimSR //%
					  );

				}
				secTempPrev = uptime_counter;
			}
		}

		// проверим - можно ли продолжать отбор тела?
		if (! end_condition_SR())	{
			break;  // продолжаем отбор тела
		}

		// Температура в кубе превысила температуру при которой надо отбирать СР
		closeKlp(klp_sr); 			// Отключение клапана продукта
			start_valve_PWMpercent(klp_glwhq,
					getFloatParam(DEFL_PARAMS, "timeChimRectOtbGlv"),
					100);
		setNewMainStatus(PROC_HV);			// Переход к отбору хвостов
		if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
		 /* fall through */

	case PROC_HV:
		// Отбор хвостовых фракций
		t = getCubeTemp();
		if (t < getFloatParam(DEFL_PARAMS, "tempEndRect")) {
			break;
		}
		// Температура достигла отметки окончания ректификации
		// Переход к окончанию процесса
		setPower(0);		// Снятие мощности с тэна
		closeKlp(klp_glwhq); 	// Отключение клапана отбора голов/хвостов
		secTempPrev = uptime_counter;
		setNewMainStatus(PROC_WAITEND);
		if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
#ifdef DEBUG
		ESP_LOGI(TAG, "Switch state to wait End of Rectification.");
#endif
		 /* fall through */

	case PROC_WAITEND:
		// Отключение нагрева, подача воды для охлаждения
		if (uptime_counter - secTempPrev > 180) {
			setPower(0);		// Снятие мощности с тэна
			closeAllKlp();		// Закрытие всех клапанов.
			SecondsEnd = uptime_counter;
			sprintf(b, "Rectification complete, time: %02ld:%02ld:%02ld", uptime_counter/3600, (uptime_counter/60)%60, uptime_counter%60);
			sendSMS(b);
        		setNewMainStatus(PROC_END);
			if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
#ifdef DEBUG
			ESP_LOGI(TAG, "%s", b);
#endif
		}
		break;

	case PROC_END:
		// Окончание работы
		break;
	}
}

// Обработка состояний в режиме дистилляции
void Distillation(void)
{
	double t;
	char b[80];

	switch (MainStatus) {
	case START_WAIT:
		// Ожидание запуска процесса
		break;
	case PROC_START:
		// Начало процесса
		startPressure = bmpTruePressure; // Фиксация атм. давления.
		setNewMainStatus(PROC_RAZGON);
		if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
		setPower(getIntParam(DEFL_PARAMS, "maxPower"));	//  максимальная мощность для разгона
		 /* fall through */

