ys1797/esp32_hd/main/hd_main.c
	case PROC_RAZGON:
		// Разгон до рабочей температуры
		t = getCubeTemp();
		if (-1 == t) break;
		if (t < getFloatParam(DEFL_PARAMS, "tempEndRectRazgon")) break;

		// Открытие клапана воды
		openKlp(klp_water);

		setNewMainStatus(PROC_DISTILL);
		if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
		setPower(getIntParam(DEFL_PARAMS, "powerDistil"));	// Мощность дистилляции
		 /* fall through */

	case PROC_DISTILL:
		// Процесс дистилляции
		t = getCubeTemp();
		if (t < getFloatParam(DEFL_PARAMS, "tempEndDistil")) {
			break;
		}

		secTempPrev = uptime_counter;
		setNewMainStatus(PROC_WAITEND);			// Переход к окончанию процесса
		if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
		 /* fall through */

	case PROC_WAITEND:
		// Отключение нагрева, подача воды для охлаждения
		setPower(0);		// Снятие мощности с тэна
		if (uptime_counter - secTempPrev > 180) {
			setNewMainStatus(PROC_END);
			SecondsEnd = uptime_counter;
			if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
		}
		break;

	case PROC_END:
		// Окончание работы
		setPower(0);		// Снятие мощности с тэна
		closeAllKlp();		// Закрытие всех клапанов.
		sprintf(b, "Distillation complete, time: %02ld:%02ld:%02ld", uptime_counter/3600, (uptime_counter/60)%60, uptime_counter%60);
		sendSMS(b);
		break;
	}
}

/*
 * выключение клапана без сброса �Ш�М
 * @param valve_num - номер клапана
 */
void valve_off(int valve_num){
	if (valve_num>=MAX_KLP) {
		ESP_LOGE("valve_OFF", "incorrect valve num %d", valve_num);
		return;
	}
	ledc_channel_t ch = Klp[valve_num].channel;
	ledc_set_duty(LEDC_HIGH_SPEED_MODE, ch, 0);
	ledc_update_duty(LEDC_HIGH_SPEED_MODE, ch);
	LEDC.channel_group[0].channel[ch].conf0.sig_out_en = 0;
	Klp[valve_num].is_open = false;
	Klp[valve_num].timer_sec = 0;
	//ESP_LOGI(TAG, "valve %d OFF", valve_num);
}



/*
 * Закрытие всех клапанов.
 */
void closeAllKlp(void)
{
	for (int i=0; i<MAX_KLP; i++)	closeKlp(i);
}

/*
 * задача включения клапана, номер клапана в аргументе *arg как *int
 * Самоудаляется после отработки
 * Включает клапан
 * -для снижения тока и нагрева клапана:
 * после включения и выдерживания паузы на механическое включение
 * ток клапана снижается переводом на %PWM
 *
 * @*arg - *int номера клапана (!!! д.быть static !!!)
 */
static void valve_open_task(void *arg){
	int valve_num=*(int*)arg;
	if (valve_num >=MAX_KLP)
		vTaskDelete(NULL);

	ledc_channel_t ch = Klp[valve_num].channel;
	LEDC.channel_group[0].channel[ch].conf0.sig_out_en = 1;
	if (getIntParam(DEFL_PARAMS,"klpSilentNode")) {
		ledc_set_fade_with_time(LEDC_HIGH_SPEED_MODE, ch, VALVE_DUTY, VALVE_ON_FADE_TIME_MS);
		ledc_fade_start(LEDC_HIGH_SPEED_MODE, ch, LEDC_FADE_NO_WAIT);
		vTaskDelay(VALVE_ON_FADE_TIME_MS/portTICK_PERIOD_MS);
	} else {
		ledc_set_duty(LEDC_HIGH_SPEED_MODE, ch, VALVE_DUTY);
		ledc_update_duty(LEDC_HIGH_SPEED_MODE, ch);
	}
#define KEEP_KLP_PWM 30  // процент ШИМ удержания 
#define KEEP_KLP_DELAY_MS 150  // задержка перевода в ШИМ удержания после включения, мс 
	//ESP_LOGI("keep_valve", "valve %d prc:%d delay:%d", valve_num,getIntDEFparam("vlvKeepPWM"),getIntDEFparam("vlvDelayLowPWM"));
	// ждем пока механика клапана включится 
	vTaskDelay(KEEP_KLP_DELAY_MS/portTICK_PERIOD_MS);
	// снижаем ток
	ledc_set_duty(LEDC_HIGH_SPEED_MODE, ch, ((VALVE_DUTY*KEEP_KLP_PWM))/100ul);
	ledc_update_duty(LEDC_HIGH_SPEED_MODE, ch);
	vTaskDelete(NULL);
}


/*
 * Открытие клапана
 * @param valve_num - номер клапана
 */
void valve_on(int valve_num){
	if (valve_num>=MAX_KLP) return;
static int num;
	num=valve_num;
	//---запускаем задачу открытия клапана 
	xTaskCreate(valve_open_task, "valve_open", 4096, (void *)&num, 5, NULL);
	Klp[valve_num].is_open = true;
	Klp[valve_num].timer_sec = 0;
	//ESP_LOGI(TAG, "valve %d ON", valve_num);
}


/*
 * Открытие клапана воды
 */
void openKlp(int i)
{
	valve_on(i);
	Klp[i].is_pwm = false;
}

/*
 * Закрытие клапана с выключением ШИМ 
 */
void closeKlp(int i)
{
	valve_off(i);
	Klp[i].is_pwm = false;
}

/*
 * Запуск шима клапана
 */
void startKlpPwm(int i, float topen, float tclose)
{
	if (i>=MAX_KLP) return;
	ESP_LOGI(TAG, "PWM klp %d %f/%f", i, topen, tclose);
	Klp[i].open_time = topen;	// Время в течении которого клапан открыт
	Klp[i].close_time = tclose;	// Время в течении которого клапан закрыт
	Klp[i].timer_sec = 0;	// Начальное состояние - клапан закрыт
	Klp[i].is_open = false;
	Klp[i].is_pwm = true;	// Запускаем медленный Шим режим
}

/* Запуск программного ШИМ с параметрами
* @клапан
* @период в сек
* @процент времени открытия
*/
void start_valve_PWMpercent(int valve_num, int period_sec, int percent_open){
	int topened= (period_sec*percent_open+50)/100l;
	int tclosed= period_sec-topened;
	if ((topened < 0)||(topened<0)||(period_sec==0)){
		ESP_LOGE("startPWN", "incorrect param,period %d open %d close %d", period_sec, topened, tclosed);
		return;
	}
	startKlpPwm(valve_num, topened, tclosed);
}

static struct {
    struct arg_str *value;
    struct arg_end *end;
} set_args;

static int set_ct(int argc, char **argv)
{
	int nerrors = arg_parse(argc, argv, (void **) &set_args);
	if (nerrors != 0) {
		arg_print_errors(stderr, set_args.end, argv[0]);
		return 1;
	}
	const char *values = set_args.value->sval[0];
	testCubeTemp = atof(values);
	emulate_devices = 1;
	ESP_LOGI(TAG, "New Cube temp: %f\n", testCubeTemp);
	return 0;
}

const esp_console_cmd_t set_ct_cmd = {
        .command = "t",
        .help = "Emulate cube temp",
        .hint = NULL,
        .func = &set_ct,
        .argtable = &set_args
};

/* 'version' command */
static int get_version(int argc, char **argv)
{
	esp_chip_info_t info;
	esp_chip_info(&info);
	uint32_t size_flash_chip;
	esp_flash_get_size(NULL, &size_flash_chip);
	printf("IDF Version:%s\r\n", esp_get_idf_version());
	printf("Chip info:\r\n");
	printf("\tmodel:%s\r\n", info.model == CHIP_ESP32 ? "ESP32" : "Unknow");
	printf("\tcores:%d\r\n", info.cores);
	printf("\tfeature:%s%s%s%s%ld%s\r\n",
           info.features & CHIP_FEATURE_WIFI_BGN ? "/802.11bgn" : "",
           info.features & CHIP_FEATURE_BLE ? "/BLE" : "",
           info.features & CHIP_FEATURE_BT ? "/BT" : "",
           info.features & CHIP_FEATURE_EMB_FLASH ? "/Embedded-Flash:" : "/External-Flash:",
           size_flash_chip / (1024 * 1024), " MB");
	printf("\trevision number:%d\r\n", info.revision);
	return 0;
}

static void register_version()
{
    const esp_console_cmd_t cmd = {
        .command = "version",
        .help = "Get version of chip and SDK",
        .hint = NULL,
        .func = &get_version,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

